{"main_language": null, "ohloh_name": "bibliofill", "max_month": "2009-06-01T00:00:00Z", "description": "[The Serval Project](http://www.servalproject.org/) lets mobile phones make phone calls to each other peer-to-peer without a base station.", "tags": ["ajax", "bibliographic", "reference", "xml", "autofill", "metadata"], "ohloh_analysis": "19276088", "total_code_lines": "0", "ohloh_description": "Welcome to BiblioFill, the AJAX method using identifiers (PMID, UT, DOI, ISBN, etc.) to fill in web forms with bibliographic information extracted from databases and library catalogs. \n\nINTRODUCTIONBiblioFill help the repository users to import bibliographic metadata from PubMed, Web of Science, RERO or CrossRef record using the identifier and calling the web services to fill in automatically the Web entry form \n\nVisit us at http://code.google.com/p/bibliofill \n\nPlease remember that this is an early version, not all features are  implemented yet, and not everything might work as expected. \n\nThis AJAX system has been implemented in Lausanne Repository (SERVAL) to search/retrieve records using DOI, ISBN and database unique identifiers (PubMed, Web of Science and RERO), parsing XML response and mapping metadata fields before the import into the Repository record creation form \n\nINSTALLATIONImportant : This program only works in a server with PHP (4 or 5) and requires the Client URL Library (cURL : http://ch2.php.net/manual/en/book.curl.php) and also the program NuSOAP (http://sourceforge.net/projects/nusoap/) for the use of the Web of Knowledge Web Service (the file nusoap.php is included in the package)  \n\n1) Unzip BiblioFill to a directory of your server : you mus have 5 files : \n\nlookup.php lookup.js nusoap.php licence.txt readme.txt   2) modifiy your web form, add the following lines in the head section of the HTML to introduce the javascript : \n\n3) add a field select to the form with the list of identifiers allowed and a text field for the identificator : \n\n  \n  DOI\n  PubMed/pmid\n  RERO/id\n  RERO/isbn\n  Web of Science/id    \n  \n\n  4) add a button to execute the AJAX method \n\n  5) Be sure that the fields of your form have the same names used in the javascript \n\nIf not, you must modify your form or the jvascript to use exactly the same names \n\n6) Introduce your informations in the file \"lookup.php\" :  \n\nCrossRef : login and Password in the URL PubMed : e-mail in the URL The CrossRef Web Services requires a login / password. For the libraries, this service is free but you must sign the library agreement : http://www.crossref.org/03libraries/33library_agreement.html and then you'll recieve the access codes that you can put here \n\nThe Web Service of PubMed is completly public but it's recomended to introduce your e-mail in the URL to facilitate contact in case of problems or abuse \n\nThe RERO Web Service is also public and don't requires login or e-mail \n\nYou must have a Web of Knowledge Licence and sign the agreement allowing the use of their web services before!!! If you don't have a licence or agreement, please contact ISI : http://www.isiwebofknowledge.com/ \n\nIMPORTANTIf you make modifications to this program and you distribute a version of  \nyour build, be sure to obey the GPL license. You have to include the  \nsourcecode, or make it availible for download \nSTAFFWho are the guy that sacrifice so much time to bring you this wonderful program? \n\nPablo Iriarte \n\nBut I'm not alone, I would like to thanks the following : \n\nThe team of the medical library for support and help me The team of the BCU and CI in Lausanne for the collaboration in the implementation with the university repository Serval http://serval.unil.ch Goodbye and happy sharing ;) \n\nPS : if you've implemented this system in your repository or another web form, thanks to send me a little message and I'll included the link in this page \n\nLEGALBiblioFill Version : 20090618 Author : Pablo Iriarte e-mail : pablo@pablog.ch Organization : BiUM / CHUV (Mediacal Library of the University Hospital), Lausanne. Switzerland Copyright (C) 2009 Pablo Iriarte This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. \n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details. \n\nYou should have received a copy of the GNU General Public License along with this program.  If not, see .", "updated_at": "2014-03-15T11:23:03Z", "min_month": "2009-06-01T00:00:00Z", "total_commit_count": "1", "ohloh_id": "372218", "name": "Serval Project", "total_contributor_count": "1", "twelve_month_contributor_count": "0", "factoids": ["Short source control history", "Stable Y-O-Y development activity", "No recent development activity"], "twelve_month_commit_count": "0"}