{
    "description": "[Starkit](http://www.starkitsystems.com/) is a private cloud plug-n-play secure email server for private communication allowing you the benefits of secure email as soon as you turn it on. Bundled with Web-based interface for anywhere access. Apart from a Secure Mail Server You can use Starkit as your Secure Private Cloud storage to save important documents, photos and videos and access your stuff from anywhere. Requires zero maintenance.", 
    "name": "Starkit", 
    "ohloh": {
        "main_language": "Tcl", 
        "max_month": "2011-03-01T00:00:00Z", 
        "description": "A Tclkit is a single-file executable that provides a complete Tcl and Tk runtime and can execute both normal tcl scripts or script archive files known as StarKits. Tclkit is provided pre-built for a number of platforms and is updated to track Tcl releases for the major platforms (Windows, Linux and MacOS X). \n\nDownloadingFor pre-built files see the TclkitDownloads page. \n\nBuilding from sourceSee BuildingTclkit \n\nLicenseThe Tclkit-specific sources are license free, they just have a copyright. Hold the author(s) harmless and any lawful use is permitted. \n\nThis does not apply to any of the sources of the other major Open Source Software components used in Tclkit, which each have very liberal BSD/MIT-like licenses: \n\nIncrTcl, Metakit, Tcl/Tk, TclVFS, Zlib  \nAcknowledgementsThe original release of Tclkit relied heavily on Matt Newman's Tcl implementation of VFS, a \"Virtual File System\" layer for Tcl. Since March 2002, Tclkit uses the next generation C implementation by Vince Darley, which has become part of the standard Tcl core. Both their contributions and feedback are hereby very gratefully acknowledged. \n\nOver the past several years, Steve Landers has contributed greatly, most notably by telling the story of Tclkit (and Starkits, and Metakit, and Critcl) through numerous presentations at Tcl and Unix conferences around the world. \n\nTelindustries in the US, Steve Blinkhorn in the UK, and after them an increasing number of users of Tclkit, have helped take Tclkit forward by putting it to the real test and using this in production environments. Tclkit ports \n\nMany thanks also to a growing team of people who have contributed builds of Tclkit for various platforms - it wouldn't be in all those places without their help: \n\nReinhard Max Daniel Steffen Steve Landers Tom Krehbiel Donal Fellows Bob Techentin Detlef Groth George Peter Staplin David Zolli Paul Obermeier Pat Thoyts ... with apologies if I forgot anyone!", 
        "tags": [], 
        "total_code_lines": 46592, 
        "total_contributor_count": 2, 
        "twelve_month_contributor_count": 0, 
        "updated_at": "2014-04-09T07:10:21Z", 
        "analysis": "19471473", 
        "min_month": "2009-02-01T00:00:00Z", 
        "factoids": [
            "Young, but established codebase", 
            "Average number of code comments", 
            "Stable Y-O-Y development activity", 
            "No recent development activity"
        ], 
        "twelve_month_commit_count": 0, 
        "total_commit_count": 10, 
        "id": "316614", 
        "name": "tclkit"
    }
}